let arr = [
  { 
        id:1,
        name: "赵灿龙",
        result: [
          {
            data: "2023-3-31",
            subject: [
              {
                name: "机试",
                score: 90,
              },
              {
                name: "笔试",
                score: 51,
              },
            ],
          },
          {
            data: "2023-4-7",
            subject: [
              {
                name: "机试",
                score: 70,
              },
              {
                name: "笔试",
                score: 0,
              },
            ],
          },
          {
            data: "2023-4-14",
            subject: [
              {
                name: "机试",
                score: 65,
              },
              {
                name: "笔试",
                score: 29,
              },
            ],
          },
          {
            data: "2023-4-21",
            subject: [
              {
                name: "机试",
                score: 50,
              },
              {
                name: "笔试",
                score: 0,
              },
            ],
          },
        ],
      },
  {
          id:2,
        name: "张三",
        result: [
          {
            data: "2023-3-31",
            subject: [
              {
                name: "机试",
                score: 70,
              },
              {
                name: "笔试",
                score: 0,
              },
            ],
          },
          {
            data: "2023-4-4",
            subject: [
              {
                name: "机试",
                score: 70,
              },
              {
                name: "笔试",
                score: 58,
              },
            ],
          },
          {
            data: "2023-4-11",
            subject: [
              {
                name: "机试",
                score: 65,
              },
              {
                name: "笔试",
                score: 0,
              },
            ],
          },
          {
            data: "2023-4-21",
            subject: [
              {
                name: "机试",
                score: 80,
              },
              {
                name: "笔试",
                score: 51,
              },
            ],
          },
        ],
      },
];
let arr1 = [
  {
    names: "陈静",
    subject:[60,85,35,60,65,65,75,70,64.375]
  },
    {
    names: "李泽",
    subject:[99,38,100,69,70,50,92,71,73.625]
  },
  {
    names: "赵帅博",
    subject:[90,51,70,60.5,65,29,50,50,39.5]
  },
 {
    names: "刘佳佳",
    subject:[75,45,70,57.5,70,60,50,55,60.3125]
  },
  {
    names: "宋好影",
    subject:[75,62,70,66,70,58,65,61.5,65.9375]
  },
  {
    names: "齐博超",
    subject:[95,65,75,70,75,36,95,65.5,72.0625]
  },
  {
    names: "郭栋彬",
    subject:[85,67,99,83,70,49,90,69.5,76.5625]
  },
  {
    names: "董阳光",
    subject:[80,61,70,65.5,73,41.5,90,65.75,68.34375]
  },
  {
    names: "李彦洋",
    subject:[85,66,65,65.5,65,60,75,67.5,68.625]
  },
  {
    names: "张亚哲",
    subject:[95,61,75,68,70,52,80,66,70.875]
  },
  {
    names: "刘振洲",
    subject:[85,71,66,68.5,60,45,70,57.5,65.375]
  },
  {
    names: "董帅磊",
    subject:[70,67,60,63.5,68,46,85,65.5,65.625]
  },
  {
    names: "赵灿龙",
    subject:[90,51,70,60.5,65,29,50,39.5,56.875]
  },
  {
    names: "杨浩冰",
    subject:[50,66,75,70.5,60,65,50,57.5,61.75]
  },
  {
    names: "晋帅豪",
    subject:[85,72,75,73.5,65,78,80,79,75.9375]
  },
  {
    names: "郑哲员",
    subject:[75,85,25,55,65,34.5,70,52.25,57.71875]
  },
  {
    names: "李泉澳",
    subject:[100,66,100,83,80,57,95,76,82.125]
  },
   {
    names: "赵宗福",
    subject:[70,60,70,65,62,46,70,58,62.625]
  },
  
    ]